{
  "posts": [
    {
      "id": "001",
      "postid": "cybernews-launch",
      "title": "Cyber News Website & Facebook Page Launched!",
      "slug": "cyber-news-facebook-page-launched",
      "author": "Cyber News Team",
      "date": "2025-05-04",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/cybernews.jpg",
          "alt": "GTA 6 Trailer"
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "We're thrilled to announce the official launch of the Cyber News Facebook page — your daily dose of cybersecurity updates, threats, and safety tips.",
      "content": "Hey everyone!\n\nExcited to announce the launch of Facebook page: Cyber News!\n\nIn today's rapidly evolving digital world, staying informed about cybersecurity is more crucial than ever. This page will be your go-to source for the latest news, trends, threats, and tips to help you navigate the cyber landscape safely and securely.",
      "tags": [
        "cybersecurity",
        "news",
        "facebook",
        "launch"
      ],
      "views": 1247,
      "type": "post"
    },
    {
      "id": "002",
      "postid": "gta6-second-trailer",
      "title": "GTA 6 Second Trailer Released – Here's What We Know!",
      "slug": "gta6-second-trailer-released",
      "author": "Cyber News Team",
      "date": "2025-05-07",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/gta1.jpg",
          "alt": "GTA 6 Trailer"
        },
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/gta2.png",
          "alt": "GTA 6 2nd Trailer"
        },
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/gta3.jpg",
          "alt": "GTA 6"
        }
      ],
      "video": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/videos/gta_trailer_2.mp4",
          "alt": "GTA 6 Second Trailer"
        }
      ],
      "summary": "Rockstar Games has officially dropped the second trailer for GTA 6, revealing stunning gameplay, characters, and more from Vice City.",
      "content": "Big news from the gaming world! Rockstar Games has released the highly anticipated second trailer for Grand Theft Auto VI (GTA 6).\n\nThe trailer showcases breathtaking visuals of Vice City, a deeper look at the main characters, and hints at the storyline fans have been waiting for. With new mechanics, immersive environments, and evolved open-world gameplay, GTA 6 is shaping up to be the most ambitious entry in the series yet.\n\nStay tuned as we break down everything you might’ve missed in the trailer — from easter eggs to gameplay insights!",
      "tags": [
        "GTA6",
        "gaming",
        "trailer",
        "rockstar",
        "vice city"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "003",
      "postid": "iphone-maker-builds-mitsubishi-evs",
      "title": "iPhone maker announces plan to build Mitsubishi EVs",
      "slug": "iphone-maker-builds-mitsubishi-evs",
      "author": "Cyber News Team",
      "date": "2025-05-08",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/iPhone%20maker%20announces%20plan%20to%20build%20Mitsubishi%20EVs.webp",
          "alt": "Foxconn and Mitsubishi team up for electric vehicles"
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "Foxconn, Apple’s iPhone manufacturer, plans to build electric vehicles for Mitsubishi Motors in Taiwan under a new partnership, with the first model expected by the end of 2026 in Australia and New Zealand.",
      "content": "Foxconn, the maker of Apple's iPhones, has announced plans to produce electric vehicles (EV) for Japanese car giant Mitsubishi Motors. Under a new agreement in principle, Foxconn's EV joint venture, Foxtron, will design and manufacture vehicles in Taiwan specifically for Mitsubishi. The companies aim to have the new model ready by the end of next year, marking Foxconn’s first major deal in the EV sector.\n\nThe collaboration represents a significant step for both companies. Foxtron, a joint venture between Foxconn and Taiwanese car maker Yulon Motor, will be responsible for the car's design and manufacturing management. The resulting EVs are expected to enter the Australian and New Zealand markets in the second half of 2026.\n\nCurrently, the deal is a memorandum of understanding—a non-binding agreement—though both parties confirmed they will continue discussions toward a final contract. Foxconn, known as the world’s largest contract electronics manufacturer and a key Apple supplier, has shown growing interest in the automobile sector, including previous talks with Nissan.\n\nMitsubishi Motors is part of a broader automotive alliance with Nissan and Renault. The partnership comes as Japanese automakers face increasing pressure from rapidly growing Chinese EV brands like BYD, especially in regions such as South East Asia, South America, and Europe.\n\nThis move reflects the global shift toward electrification and the intensifying competition in the EV market, where established brands are seeking innovative ways to keep up with China’s swift advancements.",
      "tags": [
        "Electric cars",
        "Foxconn",
        "Mitsubishi",
        "Apple",
        "Car industry",
        "International Business"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "004",
      "postid": "best-video-platform-youtube",
      "title": "The Best Video Platform: YouTube",
      "slug": "best-video-platform-youtube",
      "author": "Cyber News Team",
      "date": "2025-05-08",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/YouTube.jpg",
          "alt": "YouTube"
        },
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/ytfounders.jpg",
          "alt": "YouTube Founders"
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "YouTube remains the undisputed leader in online video sharing and streaming, providing content creators and audiences worldwide with unmatched access to videos, live streams, monetization tools, and community engagement features.",
      "content": "YouTube, launched in 2005 and acquired by Google in 2006, has grown into the world's most popular video-sharing platform. With over 2.5 billion monthly users and billions of hours watched every day, YouTube dominates the digital video space.\n\nThe platform allows creators to upload and share videos globally, with tools for monetization, live streaming, community posts, and analytics. YouTube's algorithm suggests personalized content, helping users discover new creators and topics.\n\nIn addition to entertainment, YouTube serves as an educational hub, a news source, and a marketing tool for businesses. Features like YouTube Shorts, Super Chat, Memberships, and the YouTube Partner Program empower creators to earn and grow communities.\n\nDespite facing competition from platforms like TikTok, Instagram Reels, and Twitch, YouTube remains unmatched in content variety, video length flexibility, and monetization options.\n\nWith continuous updates and support for creators and viewers alike, YouTube continues to shape the future of video consumption on the internet.",
      "tags": [
        "YouTube",
        "Video Platform",
        "Content Creators",
        "Streaming",
        "Google",
        "Online Video"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "005",
      "postid": "coldriver-lostkeys-malware",
      "title": "Russian Hackers Using ClickFix Fake CAPTCHA to Deploy New LOSTKEYS Malware",
      "slug": "coldriver-lostkeys-malware",
      "author": "Cyber News Team",
      "date": "2025-05-08",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/malware-click.webp",
          "alt": ""
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "Russia-linked hackers known as COLDRIVER are deploying a new spyware tool, LOSTKEYS, using fake CAPTCHA pages as bait in a sophisticated cyber-espionage campaign.",
      "content": "The Russia-linked threat group COLDRIVER has been linked to a new malware strain named LOSTKEYS, discovered during recent cyber-espionage operations. This malware is spread via fake CAPTCHA lures resembling ClickFix pop-ups. \n\nAccording to Google’s Threat Intelligence Group (GTIG), LOSTKEYS is designed to steal specific file types from targeted directories and collect sensitive system data, including running processes. The malware has been active in January, March, and April of 2025.\n\nIts targets include Western government and military advisors (both current and former), journalists, think tanks, NGOs, and Ukrainian-affiliated individuals. This marks a shift in COLDRIVER’s strategy, which previously focused on credential phishing. \n\nLOSTKEYS is the second malware attributed to the group, following SPICA. COLDRIVER is also known by aliases like Callisto, Star Blizzard, and UNC4057, and remains a persistent threat in the geopolitical cyber landscape.",
      "tags": [
        "cybersecurity",
        "malware",
        "Russia",
        "espionage",
        "LOSTKEYS",
        "COLDRIVER"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "006",
      "postid": "apple-ai-search-safari",
      "title": "Apple Looks to Add AI Search to Safari in Potential Blow for Google",
      "slug": "apple-ai-search-safari",
      "author": "Cyber News Team",
      "date": "2025-05-08",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/safari.jpg",
          "alt": "apple safari"
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "Apple plans to integrate AI-powered search into Safari, potentially threatening Google's dominance as the default search provider on iOS devices.",
      "content": "Apple is reportedly exploring the integration of AI-driven search engines into its Safari browser, according to Bloomberg News. This move could challenge Google's long-standing dominance in the search market, especially as it pays Apple approximately $20 billion annually to remain the default engine.\n\nApple executive Eddy Cue, during his testimony in the U.S. Department of Justice's antitrust case against Google, stated that Safari searches declined last month due to users increasingly using AI tools. This shift signals growing interest in AI alternatives like OpenAI and Perplexity.\n\nApple has already partnered with OpenAI to bring ChatGPT into Siri, and Google is working on securing a deal to integrate Gemini AI into Apple devices by mid-year. Analysts believe that even if Google loses its exclusive default position on Safari, it could face serious consequences in the digital ad space.\n\nCue mentioned that Apple would consider adding AI search engines to Safari's list of search providers, although they may not replace Google as the default. As Apple leans further into AI, the traditional search landscape may face a major disruption.",
      "tags": [
        "Apple",
        "Safari",
        "AI",
        "Google",
        "search engine",
        "OpenAI",
        "ChatGPT",
        "Perplexity",
        "Gemini"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "007",
      "postid": "bill-gates-ai-future-vision",
      "title": "Bill Gates Shares Vision for AI's Role in Solving Global Challenges",
      "slug": "bill-gates-ai-future-vision",
      "author": "Cyber News Team",
      "date": "2025-05-09",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/Bill-gates-facebook-1200x675.jpg",
          "alt": "Bill Gates discussing AI at a tech forum"
        }
      ],
      "video": [
        {
          "url": "https://github.com/Nadishan-Dev/Cyber-News/raw/refs/heads/main/videos/videoplayback.mp4",
          "alt": "Bill Gates"
        }
      ],
      "summary": "Bill Gates emphasized the transformative potential of AI in healthcare, education, and climate change during a global tech conference.",
      "content": "During a global technology summit, Bill Gates outlined his optimistic vision of AI as a tool to combat global challenges. He highlighted AI's potential in improving medical diagnostics, personalizing education, and optimizing climate models. Gates also discussed ethical concerns and emphasized the need for global cooperation and regulations.\n\nHe acknowledged risks such as job displacement and algorithmic bias, advocating for transparency in AI development. Gates concluded by urging governments, researchers, and corporations to work together in ensuring AI benefits humanity equitably.",
      "tags": [
        "AI",
        "Bill Gates",
        "Global Tech",
        "Healthcare",
        "Education",
        "Climate Change"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "008",
      "postid": "wikipedia-online-safety-act",
      "title": "Wikipedia Legally Challenges 'Flawed' Online Safety Rules",
      "slug": "wikipedia-online-safety-act",
      "author": "Chris Vallance",
      "date": "2025-05-09",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/refs/heads/main/images/Wikipedia.webp",
          "alt": "Wikipedia logo on a phone screen"
        }
      ],
      "video": [
        {
          "url": "",
          "alt": ""
        }
      ],
      "summary": "Wikipedia is taking legal action against the UK's Online Safety Act, arguing it threatens the privacy and safety of its volunteer editors and could misclassify the site under overly broad regulations.",
      "content": "Wikipedia is taking legal action against new Online Safety Act regulations it says could threaten the safety of its volunteer editors and their ability to keep harmful content off the site. The Wikimedia Foundation is seeking a judicial review of rules that could mean Wikipedia is subjected to the toughest duties required of websites under the act.\n\nLead counsel Phil Bradley-Schmieg called it 'unfortunate' that they must defend Wikipedia's contributors from flawed legislation. Ofcom has not yet categorized any services but has requested information from Wikipedia.\n\nThe Foundation fears that if Wikipedia is designated as a Category 1 service, it may be forced to verify editors' identities, potentially endangering their privacy and safety. This could discourage contributions, especially to sensitive or controversial topics. Wikipedia argues the regulations risk both overregulating low-risk sites like theirs and missing more harmful platforms.\n\nLegal experts say Wikimedia faces a high bar to overturn the regulations. The case is seen as the first of many likely challenges to the vast and complex Online Safety Act.",
      "tags": [
        "Wikipedia",
        "Online Safety Act",
        "Regulation",
        "Privacy",
        "UK Law",
        "Ofcom",
        "Judicial Review"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "009",
      "postid": "manus-unlocked-free-daily-bonus",
      "title": "Manus Unlocked: No wait-lists, Free Daily tasks & 1,000 bonus credits",
      "slug": "manus-unlocked-free-daily-bonus",
      "author": "Cyber News Team",
      "date": "2025-05-13",
      "links": [
        "ttttttttttttttttttttttt"
      ],
      "category": "ttttt",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/Manus.png",
          "alt": "Manus app promotional image"
        }
      ],
      "video": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/videos/manus.mp4",
          "alt": "Manus platform feature video"
        }
      ],
      "summary": "Manus just got a big upgrade! No waitlist, daily free task with 300 credits, and a 1,000 credit bonus for everyone. Start exploring now!",
      "content": "Starting today, we're launching additional access to Manus!\n\n*What's New:\n- Available to all users — no waitlist required\n- One free daily task (worth 300 credits)\n- A one-time 1,000 credit bonus for all users\n\nThis update brings more value and flexibility for everyone. Whether you're a returning user or brand new to Manus, you now have free tools to explore AI features every day. \n\nGet started here:* [https://manus.im/app](https://manus.im/app)",
      "tags": [
        "Manus",
        "AI Tools",
        "Productivity",
        "Launch",
        "Free Credits",
        "No Waitlist"
      ],
      "views": 0,
      "type": "post"
    },
    {
      "id": "010",
      "postid": "chinese-e-commerce-sites-offer-discounts-of-up-to-351-on-apple-s-latest-iphones",
      "title": "Chinese e-commerce sites offer discounts of up to $351 on Apple's latest iPhones",
      "slug": "chinese-e-commerce-sites-offer-discounts-of-up-to-351-on-apple-s-latest-iphones",
      "author": "Cyber News Team",
      "date": "2025-05-14",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/FFSOR7ZXFBPC7IEBMZTU4TMKNA.jpg",
          "alt": "Chinese e-commerce sites offer discounts of up to $351 on Apple's latest iPhones"
        }
      ],
      "video": [],
      "summary": "BEIJING, May 14 (Reuters) - Chinese e-commerce platforms are offering discounts of up to 2,530 yuan ($351) on Apple's latest iPhone 16 models, an effort to spur sales as first-quarter shipments by the U.S. tech giant fell further in its second-largest market.\nThe step comes as Chinese online retailers increasingly vie for cost-conscious consumers in a slowing economy, with price cuts taking centrestage ahead of the annual \"618\" shopping festival on June 18, one of the country's largest.",
      "content": "BEIJING, May 14 (Reuters) - Chinese e-commerce platforms are offering discounts of up to 2,530 yuan ($351) on Apple's latest iPhone 16 models, an effort to spur sales as first-quarter shipments by the U.S. tech giant fell further in its second-largest market.\nThe step comes as Chinese online retailers increasingly vie for cost-conscious consumers in a slowing economy, with price cuts taking centrestage ahead of the annual \"618\" shopping festival on June 18, one of the country's largest.\n\nJD.com (9618.HK), opens new tab, is selling the iPhone 16 Pro with storage of 128GB at 5,469 yuan, down 2,530 yuan from Apple's official price of 7,999 yuan, Reuters checks showed on Wednesday.\nThe iPhone 16 with 256GB storage is listed at 5,469 yuan, or a drop of 1,530 yuan from its official price of 6,999 yuan, including government subsidies.\nAlibaba's (9988.HK), opens new tab Tmall marketplace is offering comparable discounts, selling the iPhone 16 Pro with 128GB at 5,499 yuan, or 2,500 yuan off Apple's official price, after applying coupons that include government subsidies.\nReuters was unable to ascertain if the discounts were being offered by Apple itself or the platforms.",
      "tags": [
        "Apple"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "011",
      "postid": "advocacy-group-threatens-meta-with-injunction-over-use-of-eu-data-for-ai-training",
      "title": "Advocacy group threatens Meta with injunction over use of EU data for AI training",
      "slug": "advocacy-group-threatens-meta-with-injunction-over-use-of-eu-data-for-ai-training",
      "author": "Cyber News Team",
      "date": "2025-05-14",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/meta.jpg",
          "alt": "Advocacy group threatens Meta with injunction over use of EU data for AI training"
        }
      ],
      "video": [],
      "summary": "BRUSSELS, May 14 (Reuters) - Austrian advocacy group NOYB said on Wednesday it would seek an injunction against Meta Platforms (META.O), opens new tab that could lead to billion-euro damages claims if the tech giant goes ahead with plans to use Europeans' personal data to train its artificial intelligence models.\nNOYB (none of your business), led by privacy activist Max Schrems, said it had sent a cease and desist letter on Wednesday to Meta which plans to start using personal data from European users of Instagram and Facebook from May 27.",
      "content": "BRUSSELS, May 14 (Reuters) - Austrian advocacy group NOYB said on Wednesday it would seek an injunction against Meta Platforms (META.O), opens new tab that could lead to billion-euro damages claims if the tech giant goes ahead with plans to use Europeans' personal data to train its artificial intelligence models.\nNOYB (none of your business), led by privacy activist Max Schrems, said it had sent a cease and desist letter on Wednesday to Meta which plans to start using personal data from European users of Instagram and Facebook from May 27.\n\nMeta has cited a legitimate interest under EU privacy rules for using users' data to train and develop its generative AI models and other AI tools, which can be shared with third parties.\nThe U.S. tech giant said last month that users would receive a link to a form where they can object to their data being used for training purposes and that private messages and public data from accounts of users under the age of 18 will not be used in the training.\nSchrems criticised Meta's rationale.\n\"The European Court of Justice has already held that Meta cannot claim a 'legitimate interest' in targeting users with advertising. How should it have a 'legitimate interest' to suck up all data for AI training?\" he said in a statement.\n\n\"We are currently evaluating our options to file injunctions, but there is also the option for a subsequent class action for non-material damages. If you think about the more than 400 million European Meta users who could all demand damages of just 500 euros or so, you can do the math,\" Schrems said.\nNOYB said an injunction could be filed under the EU Collective Redress which enables consumers to pursue collective lawsuits against companies in the bloc. It set a May 21 deadline for Meta to respond.\nNOYB, which last year called on EU privacy enforcers to act, said Meta could give users an option to opt-in rather than opt-out and also provide clear conditions for AI training such as using anonymised user data, in line with EU privacy rules.",
      "tags": [
        "Meta inc",
        "AI"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "012",
      "postid": "sony-forecasts-flat-profit-this-year-as-tariffs-bite",
      "title": "Sony forecasts flat profit this year as tariffs bite",
      "slug": "sony-forecasts-flat-profit-this-year-as-tariffs-bite",
      "author": "Cyber News Team",
      "date": "2025-05-14",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/sony.jpg",
          "alt": "Sony forecasts flat profit this year as tariffs bite"
        }
      ],
      "video": [],
      "summary": "TOKYO, May 14 (Reuters) - Sony (6758.T), opens new tab said on Wednesday it expects operating profit to rise 0.3% to 1.28 trillion yen ($8.7 billion) in the financial year ending in March, after factoring in a 100 billion yen hit from U.S. President Donald Trump's trade war.\nThe estimated tariff impact does not reflect this week's trade deal between the United States and China and the actual impact could vary significantly, Sony said.",
      "content": "The Japanese conglomerate has transformed from a maker of household electronics such as the Walkman to an entertainment behemoth spanning games, movies, music and chips.\nPresident Hiroki Totoki has strengthened his grip over the conglomerate, taking the CEO role last month.\nSony is preparing for a partial spin-off of its financial unit as it focuses on entertainment. The spin-off, which would leave Sony with a stake of less than 20%, will take place in October.\nSony sold 2.8 million PlayStation 5 (PS5) units in the fourth quarter, a 38% drop compared to a year earlier.\n\nSony raised PS5 prices in Europe and Britain last month, citing higher inflation and exchange rate fluctuations.\nSony expects profit at the games business to increase by 16% this year due to higher sales of first-party games.\n\"Ghost of Yotei\" is set to launch in October, following the success of \"Ghost of Tsushima\" which has sold 13 million units on PlayStation and PC.\nIndustry observers expect \"Grand Theft VI\" to boost the console business but Take-Two Interactive (TTWO.O), opens new tab said this month it has delayed the game's release to May 2026.\nSony's operating profit including financial services rose 16% to 1.4 trillion yen in the year ended March, beating analyst estimates.\n($1 = 147.1900 yen)",
      "tags": [
        "Sony"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "013",
      "postid": "france-s-le-monde-enters-into-content-partnership-with-ai-startup-perplexity",
      "title": "France's Le Monde enters into content partnership with AI startup Perplexity",
      "slug": "france-s-le-monde-enters-into-content-partnership-with-ai-startup-perplexity",
      "author": "Cyber News Team",
      "date": "2025-05-14",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/perpexy.jpg",
          "alt": "France's Le Monde enters into content partnership with AI startup Perplexity"
        }
      ],
      "video": [],
      "summary": "May 14 (Reuters) - French newspaper Le Monde entered into a content partnership with U.S.-based artificial intelligence company Perplexity on Wednesday, as AI startups compete for deals with news publications to improve the responses of their products amid intensifying competition.\nThe deal grants Perplexity access to Le Monde's content to enhance its search engine's responses, while the newspaper will use the Nvidia-backed (NVDA.O), opens new tab startup's technology to develop new AI products.",
      "content": "This partnership will also support publishers whose content is featured in Perplexity's generated answers.\n\"At Le Monde, we have continued to explore new partnerships with leading AI players to enlarge our audience, expand our development capacities, and to build new sources of revenues,\" said Louis Dreyfus, Le Monde's CEO.\nPerplexity has already secured agreements with over a dozen media partners, including the Los Angeles Times and the Independent, as part of a program that shares a portion of ad revenue with the publishers.\nMeanwhile, AI firms have faced lawsuits from media groups and news publishers, who accuse them of unlawfully using content and articles without permission to train AI models.\nReporting by Zaheer Kachwala in Bengaluru; Editing by Mohammed Safi Shamsi",
      "tags": [
        "PerplexityAI"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "014",
      "postid": "microsoft-to-lay-off-around-3-of-workforce-in-organization-wide-cuts",
      "title": "Microsoft to lay off around 3% of workforce in organization-wide cuts",
      "slug": "microsoft-to-lay-off-around-3-of-workforce-in-organization-wide-cuts",
      "author": "Cyber News Team",
      "date": "2025-05-14",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/microsoft1.jpg",
          "alt": "Microsoft to lay off around 3% of workforce in organization-wide cuts"
        },
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/microsoft2.jpg",
          "alt": "Microsoft to lay off around 3% of workforce in organization-wide cuts"
        }
      ],
      "video": [],
      "summary": "May 13 (Reuters) - Microsoft (MSFT.O), opens new tab said on Tuesday it was laying off less than 3% of its workforce, or around 6,000 employees, as the technology giant looks to rein in costs while funneling billions of dollars into its ambitious bet on artificial intelligence.\nThe cuts will be across all levels and geographies and are likely the largest since Microsoft laid off 10,000 employees in 2023. The company let a small number of staff go in January over performance-related issues, but the new cuts are not related to that, according to CNBC, which first reported the news.",
      "content": "Big Tech has been spending heavily on AI as they see the new technology as a major growth engine, while slashing costs elsewhere to safeguard profit margins. Google has also laid off hundreds of employees in the past year, as it looks to control costs and prioritize AI, media reports have said.\n\"We continue to implement organizational changes necessary to best position the company for success in a dynamic marketplace,\" a Microsoft spokesperson said on mail.\nThe company, which had 228,000 workers as of June last year, regularly uses layoffs to prioritize staffing in its main focus areas.\nTuesday's move comes weeks after Microsoft posted stronger-than-expected growth in its cloud-computing business Azure and blowout results in the latest quarter, calming investor worries in an uncertain economy.\n\nBut the cost of scaling its AI infrastructure has weighed on profitability, with Microsoft Cloud margins narrowing to 69% in the March quarter from 72% a year ago.\nMicrosoft has earmarked $80 billion in capital spending this fiscal year, with most of it aimed at expanding data centers to ease capacity bottlenecks for artificial intelligence services.\nD.A. Davidson analyst Gil Luria said the layoffs showed Microsoft was \"very closely\" managing the margin pressure created by its heightened AI investments.\n\"We believe that every year Microsoft invests at the current levels, it would need to reduce headcount by at least 10,000 in order to make up for the higher depreciation levels due to their capital expenditures,\" he said.",
      "tags": [
        "Microsoft"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "015",
      "postid": "apple-blocks-access-to-video-game-fortnite-in-us-eu-epic-games-says",
      "title": "Apple blocks access to video game Fortnite in US, EU, Epic Games says",
      "slug": "apple-blocks-access-to-video-game-fortnite-in-us-eu-epic-games-says",
      "author": "Cyber News Team",
      "date": "2025-05-16",
      "uploadedAt": "21:40:20",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/apple.jpg",
          "alt": "Apple blocks access to video game Fortnite in US, EU, Epic Games says"
        }
      ],
      "video": [],
      "summary": "Apple has blocked access to the online game Fortnite on iPhone devices in the United States and the European Union, according to the video game maker.\n\n\"Apple has blocked our Fortnite submission so we cannot release to the U.S. App Store or to the Epic Games Store for iOS in the European Union,\" the Fortnite X account said early Friday morning.",
      "content": "Apple has blocked access to the online game Fortnite on iPhone devices in the United States and the European Union, according to the video game maker.\n\n\"Apple has blocked our Fortnite submission so we cannot release to the U.S. App Store or to the Epic Games Store for iOS in the European Union,\" the Fortnite X account said early Friday morning.\n\nReached for comment, an Apple spokesperson said: \"We asked that Epic Sweden resubmit the app update without including the U.S. storefront of the App Store so as not to impact Fortnite in other geographies. We did not take any action to remove the live version of Fortnite from alternative distribution marketplaces.\"\n\nFortnite, which is owned by Epic Games, said that the game will be offline worldwide on iOS until Apple unblocks it. \n\nThe game company said it submitted Fortnite to Apple for review last week in order to launch the program on the App Store in the U.S, according to an X post.\n\nEpic Games CEO Tim Sweeney on Thursday commented on Apple's review process, saying in a post on social media the tech giant should \"be free to review all submitted apps promptly and accept or reject according to the plain language of their guidelines.\" \n\nAdded Sweeney, \"App Review shouldn't be weaponized by senior management as a tool to delay or obstruct competition, due process, or free speech.\"\n\nEpic Games sued Apple in 2020 after Fortnite was removed from the App Store. In one of its lawsuits, it alleged Apple had built an illegal monopoly around its popular App Store. In January 2024, the Supreme Court ultimately rejected Apple's appeal in the antitrust case.\n\nApple was hit with another antitrust in March 2024 from the Justice Department, which accused the companyof stifling competition.\n\nEpic Games launched Fortnite in 2017. Since then, the popular video game has amassed millions of users worldwide.",
      "tags": [
        "Games"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "016",
      "postid": "huawei-launches-first-laptop-powered-by-harmonyos",
      "title": "Huawei Launches First Laptop Powered by HarmonyOS",
      "slug": "huawei-launches-first-laptop-powered-by-harmonyos",
      "author": "Cyber News Team",
      "date": "2025-05-17",
      "uploadedAt": "08:31:13",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/huawei-horizontal6099.logowik.com.webp",
          "alt": "Huawei Launches First Laptop Powered by HarmonyOS"
        },
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/ChatGPT-Image-May-10-2025-at-07_20_15-PM-696x464.png",
          "alt": "Huawei Launches First Laptop Powered by HarmonyOS"
        }
      ],
      "video": [],
      "summary": "Huawei has released its first laptop running HarmonyOS, moving further from Windows.",
      "content": "Huawei has officially launched its first-ever laptop powered by HarmonyOS. This marks a major step in its goal to build an independent ecosystem, free from Western software. The laptop includes strong hardware, a clean design, and full support for other Huawei devices. This release could signal a new chapter for China-based operating systems in the global market.",
      "tags": [
        "Huawei"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    },
    {
      "id": "017",
      "postid": "steam-breach-millions-of-accounts-leaked-online",
      "title": "Steam Breach: Millions of Accounts Leaked Online",
      "slug": "steam-breach-millions-of-accounts-leaked-online",
      "author": "Cyber News Team",
      "date": "2025-05-17",
      "uploadedAt": "08:34:28",
      "thumbnail": [
        {
          "url": "https://raw.githubusercontent.com/Nadishan-Dev/Cyber-News/main/images/Steam-Valve.jpg",
          "alt": "Steam Breach: Millions of Accounts Leaked Online"
        }
      ],
      "video": [],
      "summary": "A major data breach has exposed millions of Steam user accounts on the internet.",
      "content": "Steam has suffered a major security breach, leading to the leak of account details for millions of users. The leaked data includes usernames, emails, and purchase records. The breach was shared on several forums used by hackers. Valve has not released an official update yet. All Steam users are advised to change their passwords and turn on two-factor authentication to protect their accounts.",
      "tags": [
        "Steam"
      ],
      "views": 0,
      "type": "post",
      "links": [],
      "category": "Technology"
    }
  ]
}